[
    {
        "username": "SpeedRacer",
        "description": "A power user with a full set of data, including multiple garages, vehicles, checklists, and events. Ideal for testing core functionality.",
        "use_cases": [
            "Tests profile selection with a PIN.",
            "Verifies management of multiple garages and vehicles.",
            "Tests the creation and association of checklist templates.",
            "Covers both `is_raceday = true` and `is_raceday = false` event scenarios.",
            "Tests the Winner's Circle with pre-seeded lap times.",
            "Shares the 'Project Cars' garage with a door code to test sharing functionality."
        ]
    },
    {
        "username": "DriftKing",
        "description": "A user focused on a specific motorsport discipline with multiple vehicles in a single garage.",
        "use_cases": [
            "Tests profile selection without a PIN.",
            "Verifies light theme application.",
            "Tests events with multiple vehicles assigned.",
            "Ensures the system handles users with no checklists gracefully."
        ]
    },
    {
        "username": "NewbieDriver",
        "description": "A new user with minimal data. Perfect for testing the onboarding experience and initial state of features.",
        "use_cases": [
            "Tests the 'empty state' of most features (e.g., no checklists, one garage/vehicle).",
            "Verifies the 'Days Until Raceday' countdown with a future event.",
            "Good for testing the process of adding new data from a near-empty state."
        ]
    },
    {
        "username": "AdminRacer",
        "description": "An admin-focused user designed to test cross-user functionality and administrative features.",
        "use_cases": [
            "Tests the default admin PIN ('3511').",
            "Verifies that events can be created for tracks that this user did not create (shared track functionality).",
            "Tests accessing and using a shared garage by unlocking 'Project Cars' from 'SpeedRacer' with code '4321'.",
            "Provides a clean profile for testing the full lifecycle of adding garages, vehicles, events, and lap times.",
            "Tests the 'Enable Garage Deletion' admin feature."
        ]
    }
]
